## HIERARCHICAL INDEXING

In [1]:
# enables having multiple index levels on an axis
# provides way to work with higher dimensional data in lower dimensional form

In [2]:
import pandas as pd
import numpy as np

In [3]:
# prettified view of a Series with a MultiIndex as its index
data = pd.Series(np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                 [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.734861
   2   -1.571578
   3   -1.436844
b  1    0.778521
   3   -0.591766
c  1    0.541925
   2   -0.063078
d  2    0.945218
   3   -2.459856
dtype: float64

In [4]:
# unstacked version
data.unstack()

          1         2         3
a -0.734861 -1.571578 -1.436844
b  0.778521       NaN -0.591766
c  0.541925 -0.063078       NaN
d       NaN  0.945218 -2.459856

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [6]:
# with hierarchical indexed object, partial indexing is possible
# concisely select subsets of data
data['a']

1   -0.734861
2   -1.571578
3   -1.436844
dtype: float64

In [7]:
data['b']

1    0.778521
3   -0.591766
dtype: float64

In [8]:
data['c']

1    0.541925
2   -0.063078
dtype: float64

In [9]:
data['d']

2    0.945218
3   -2.459856
dtype: float64

In [10]:
# slicing
data['b':'c']

b  1    0.778521
   3   -0.591766
c  1    0.541925
   2   -0.063078
dtype: float64

In [11]:
# non-slicing, location based retrieval
data.loc[['b', 'c']]

b  1    0.778521
   3   -0.591766
c  1    0.541925
   2   -0.063078
dtype: float64

In [12]:
data

a  1   -0.734861
   2   -1.571578
   3   -1.436844
b  1    0.778521
   3   -0.591766
c  1    0.541925
   2   -0.063078
d  2    0.945218
   3   -2.459856
dtype: float64

In [13]:
# inner level selection
data.loc[:, 2]

a   -1.571578
c   -0.063078
d    0.945218
dtype: float64

In [14]:
# one more example
data.loc[:, :2]

a  1   -0.734861
   2   -1.571578
b  1    0.778521
c  1    0.541925
   2   -0.063078
d  2    0.945218
dtype: float64

In [15]:
# hierarchical indexing helps to reshape data and group-based ops
# ex. forming a pivot table

In [16]:
# rearrange data into a DataFrame using unstack method
data.unstack()

          1         2         3
a -0.734861 -1.571578 -1.436844
b  0.778521       NaN -0.591766
c  0.541925 -0.063078       NaN
d       NaN  0.945218 -2.459856

In [17]:
# In DF, either axis can have a hierarchical index
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'], 
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [18]:
# hierarchical levels can have names as strings or a Python object

In [19]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
# partial column indexing to select groups of columns
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [21]:
# MultiIndex can be created by itself and then reused
# columns preceding DF with level names could be created
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                        ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### REORDERING AND SORTING LEVELS

In [22]:
# rearrange order of levels on an axis or sort the data by values in one specific level
# swaplevel - takes two level numbers or names and returns a new object with the levels interchanged
# data remains unaltered

In [23]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [24]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [25]:
# sort_index - sorts the data using only the values in a single level
# sort_index is used with swaplevel to obtain a lexicographically sorted result by the indicated level

In [26]:
# here keys will sort in ascending order
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [27]:
# combine swaplevel and sort_level - level=0
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [28]:
# combine swaplevel and sort_level - level=1
frame.swaplevel(0, 1).sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

# NOTE:
“Data selection performance is much better on hierarchically indexed objects if the index is lexicographically sorted starting with the outermost level — that is, the result of calling sort_index(level=0) or sort_index().”

### SUMMARY STATISTICS BY LEVEL

In [29]:
# level - specify the level to aggregate by on a particular axis
# aggregate by level on either the rows or columns

In [30]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [31]:
# will sum all individual values belonging to 'key1'
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [32]:
# will sum all individual values from 'key2'
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [33]:
# sum values based by 'color' column
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### INDEXING WITH DATAFRAME'S COLUMNS

In [34]:
# condition - use one or more columns from a DF as the row index
# can be done by moving row index into the DF's columns

In [35]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 
                            'two', 'two', 'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [36]:
# set_index - creates a new DF using one or more of its columns as index
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [37]:
# columns are removed from DF but to keep them use
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [38]:
# reset_index - opposite of set_index
# hierarchical index levels are moved into the columns

In [39]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### COMBINING AND MERGING DATASETS

In [40]:
# pandas.merge - connects row in DF based on one or more keys
# pandas.concat - concatenates or 'stacks' together objects along an axis
# combine_first - enables splicing together overlapping data
# i.e to fill in missing values in one object with values from another

### DATABASE-STYLE DATAFRAME JOINS

In [41]:
# merge/join - combine datasets by linking rows using one or more keys

In [42]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [43]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [44]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [45]:
# df1 - multiple rows labeled a and b
# df2 - has only one row for each value in 'key' column

In [46]:
# many-to-one join ops

In [47]:
# calling merge
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [48]:
# not mentioning which column to join will use the overlapping column names as the key
# should be specified explicitly - good practice!

In [49]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [50]:
# different column names in each object? - specify them separately

In [51]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [52]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [53]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [54]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [55]:
# values for 'c' and 'd' and it's data are missing
# this is due to merge performing a 'inner join' by default
# the keys in the result are intersected or common set found values from both tables

# join options - left, right and outer

# outer join takes the union of keys, combining the effect of applying left and right joins

In [56]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [57]:
# many-to-many merges ops

In [58]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})

In [59]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [60]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [61]:
# performs Cartesian product of the rows
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [62]:
# join method only affects the distinct key values

In [63]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [64]:
# merge with multiple keys, pass a list of column names
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [65]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [66]:
# specify strings to append to overlapping names in left and right DF
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [67]:
# suffixies
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on Index

In [68]:
# merge key in a DF can be found in its index
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [69]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [70]:
right1

   group_val
a        3.5
b        7.0

In [71]:
# intersect the join keys
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [72]:
# form union of keys with outer join
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [73]:
# hierarchical indexed data - more complications while merging
# here joining on index is implicitly a multiple-key merge

In [75]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})

righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                      index=[['Nevada', 'Nevada',
                              'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [76]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [77]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [79]:
# indicate multiple columns to merge on as a list
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [81]:
# handle duplicate values with how='outer'
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [82]:
# using indexes of both sides of the merge
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])

right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [83]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [84]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [86]:
pd.merge(left2, right2, how='outer', 
         left_index=True, 
         right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [87]:
# performing above with join instance
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [93]:
# joining index of passed DF on one of the columns of calling DF

In [94]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [95]:
right1

   group_val
a        3.5
b        7.0

In [96]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [97]:
# simple index-on-index merge
another = pd.DataFrame([[7., 8.], [9., 10.], 
                        [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [100]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [101]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [102]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [104]:
# including all items
left2.join([right2, another], how='outer', sort=False)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

### CONCATENATING ALONG AN AXIS

In [108]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [109]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [114]:
arr_string = [['A', 'B'], 
              ['C', 'D']]
arr_string

[['A', 'B'], ['C', 'D']]

In [113]:
np.concatenate([arr_string, arr_string], axis=1)

array([['A', 'B', 'A', 'B'],
       ['C', 'D', 'C', 'D']], dtype='<U1')

In [115]:
# having labeled axes enables to further generalise array concate

In [116]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [126]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [122]:
# concate by default works along axis=0, producing another Series
# passing axis=1 will result in sorted union of indexes
pd.concat([s1, s2, s3], axis=1, sort=False)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [127]:
# intersect them by passing join='inner'
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [129]:
pd.concat([s1, s4], axis=1, sort=False)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [130]:
pd.concat([s1, s4], axis=1, sort=False, join='inner')

   0  1
a  0  0
b  1  1

In [132]:
# specify axies to be used on the other axes with join_axes
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e', 'f', 'g']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN
f  NaN  5.0
g  NaN  6.0

In [133]:
# concatenated pieces are not identifiable in the results
# create a hierarchical index on the concatenation axis
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [134]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [136]:
# combining Series along axis=1, the keys become DF's column headers
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'], sort=False)

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [137]:
# above login on DF
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                   index=['a', 'b', 'c'],
                   columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three', 'four'])

In [138]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [139]:
df2

   three  four
a      5     6
c      7     8

In [141]:
pd.concat([df1, df2], axis=1, 
          keys=['level1', 'level2'], 
          sort=False)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [145]:
# passing a dict of objects instead of a list, the dict's keys will be used for keys option
pd.concat({'level1': df1, 'level2': df2}, axis=1, sort=False)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [149]:
# naming created axis levels
pd.concat([df1, df2], axis=1, 
          keys=['level1', 'level2'],
          names=['upper', 'lower'],
          sort=False)

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [150]:
# DF where row index does not contain any relevant data
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [151]:
df1

          a         b         c         d
0 -0.302178 -0.887492 -3.698412 -1.395700
1 -0.054325  0.673844  0.086856 -1.832791
2 -0.436465  1.376692 -0.689301 -0.785763

In [152]:
df2

          b         d         a
0  0.151564 -0.402196 -0.270997
1 -0.007669 -0.943145  1.141521

In [154]:
pd.concat([df1, df2], ignore_index=True, sort=False)

          a         b         c         d
0 -0.302178 -0.887492 -3.698412 -1.395700
1 -0.054325  0.673844  0.086856 -1.832791
2 -0.436465  1.376692 -0.689301 -0.785763
3 -0.270997  0.151564       NaN -0.402196
4  1.141521 -0.007669       NaN -0.943145